# 주석문 - 모든 프로그램에서 매우 중요함 - 가독성에 중요한 영향을 미치기 때문
# 한줄 / 여러줄 주석 Python 한줄 - # ~ 
# 여러줄 - ''' ~ '''
# 문장 끝에 한 줄 주석은 필요할 경우만 함
# 주석문 사용
a = 100 # 한 줄 주석은 필요할 경우에 사용
# Python 규칙 들여쓰기 규칙
# 프로그램을 할 때에는 규칙 = {} 많이 사용함 - Curly Bracket 사용
# 파이썬에서는 들여쓰기 규칙만 있다

# 특별한 경우 콜론 ; 사용하는 경우 들여쓰기를 이용하여 구분한다. 탭 정도 4개의 공백을 기준으로 한다.
# 예약어 : Keyword 는 절대 변수 이름 또는 함수와 메서드, 클래스 이름으로 사용하지 않는다.

# 개발도구의 장점은 : 생산성을 높여줌
# 개발자의 실수를 줄여줄 수 있다.
# 변수 - 데이터를 저장하는 공간
# 변수 이름 정함 - 영어 단어를 기준으로 저장하는 데이터의 영문 뜻에 맞게 이름을 정함
# 변수 이름이 이미 사용중이면, 2개 이상의 단어를 연결해서 이름을 정함
